var AppBlog = {};
(function (parent) {
    var view = { Parent: parent };

    function setSummary(container, title, rtnFunc, parentContainer) {

        container.append(container = $('<div class="breadcrumb clearfix">'));
        container.append(Global.Click($('<a class="home" title="Return to Home">Home</a>'), rtnFunc, parentContainer));
        container.append('<span class="navigation-pipe"> </span>');
        container.append('<a href="#">' + title + '</a>');
    };
    this.Render = function (container, pageUrl) {
        var elm;
        view.Container = container.empty();

        AppBase.State.Set({
            Param: [container, pageUrl],
            Component: AppBlog.Render,
        }, 'BlogPage', pageUrl);

        BodyParent.NavTopMenu.Reset();

        container.append(container = $('<div class="columns-container">'));
        container.append(container = $('<div id="columns" class="container">'));
        setSummary(container, 'Blog', BodyParent.View.Home.Render, BodyParent.View.Home.Container);

        container.append(container = $('<div class="row">'));
        container.append(elm= $('<div class="col-md-9">' ));
        elm.append($('<div class="">' +
                    '<h2 class="page-heading"><span class= "blog_heading_title"> ডেঙ্গু জ্বর ও প্রতিকার </span> <span class="blog_heading_date">Posted on August 14, 2018</span></h2 >'+
                    + '</div>'));
        elm.append($('<div>' +
            '<img src="/Content/assets/iqraimages/Dengue.jpg" class="blog_heading_image" alt="">'+
            + '</div>'));
        elm.append($('<div class="blog_content SearchFont">' +
            '<p>' + 'মে থেকে সেপ্টেম্বর পর্যন্ত, বিশেষ করে গরম এবং বর্ষার সময়ে ডেঙ্গু জ্বরের প্রকোপ বেশি থাকে কারণ বর্ষার শুরুতে নতুন করে ডেঙ্গু ভাইরাসবাহিত মশা বিস্তার লাভ করে। গলাব্যথা বা ডায়রিয়ার মতো পরিচিত কিছু ভিন্নধর্মী লক্ষণ নিয়ে ডেঙ্গু জ্বর দেখা দেয়, এছাড়াও প্রচণ্ড জ্বর, প্রচণ্ড মাথাব্যথা, চোখের পেছনে ব্যথা, শরীরে ব্যথা, ত্বক লাল হয়ে যাওয়া এবং কিছু ক্ষেত্রে ত্বকে র‍্যাশ বা দানা দেখা দেওয়ার মত লক্ষন ও দেখা যাচ্ছে।' +
            '</p>' + '<br />' + '<p>' + 'ডেঙ্গু জ্বরের উৎপত্তি ডেঙ্গু ভাইরাসের মাধ্যমে এবং এই জ্বর ভাইরাসবাহিত এডিস ইজিপ্টাই নামক মশার কামড়ে হয়ে থাকে। ডেঙ্গু প্রধানত দুই ধরনের হয়।' +
            '</p>' + '<br />' + '<p>' + '<b> ১. ক্লাসিক্যাল ডেঙ্গু ফিভার : </b> এই ডেঙ্গু জ্বরে সাধারণত তীব্র জ্বর ও সেই সঙ্গে শরীরে প্রচণ্ড ব্যথা হয়। জ্বর ১০৫ ফারেনহাইট পর্যন্ত হয়। শরীরে বিশেষ করে হাড়, কোমর, পিঠসহ অস্থিসন্ধি ও মাংসপেশিতে তীব্র ব্যথা হয়। এ ছাড়া মাথাব্যথা ও চোখের পেছনেও ব্যথা হয়। অনেক সময় ব্যথা এত তীব্র হয় যে মনে হয় হাঁড় ভেঙে যাচ্ছে। তাই এই জ্বরের আরেক নাম ‘ব্রেক বোন ফিভার।' +
            '' + 'জ্বর হওয়ার চার বা পাঁচদিনের সময় সারা শরীরজুড়ে লালচে দানা বা র‍্যাশ দেখা যায়, অনেকটা অ্যালার্জি বা ঘামাচির মতো। এর সঙ্গে বমি বমি ভাব এমনকি বমি হতেও পারে। রোগী অতিরিক্ত ক্লান্তিবোধ করে এবং রুচি কমে যায়। কোনো কোনো রোগীর ক্ষেত্রে এর দুই বা তিনদিন পর আবার জ্বর আসে।' +
            '<br /><br />' + '<b> ২. হেমোরেজিক ফিভার: </b> এই অবস্থাটা সবচেয়ে জটিল। এই জ্বরে ক্লাসিক্যাল ডেঙ্গু জ্বরের লক্ষণ ও উপসর্গের পাশাপাশি আরো যে সমস্যাগুলো হয়, সেগুলো হলো :' +
            '</p>' + ' <p>' + 'শরীরে বিভিন্ন অংশ থেকে রক্ত পড়া শুরু হয়। যেমন: চামড়ার নিচে, নাক ও মুখ দিয়ে, মাড়ি ও দাঁত থেকে, কফের সাথে, রক্ত বমি, পায়খানার সঙ্গে তাজা রক্ত বা কালো পায়খানা, চোখের মধ্যে এবং চোখের বাইরে রক্ত পড়তে পারে।' +
            'এই রোগের বেলায় অনেক সময় বুকে পানি, পেটে পানি ইত্যাদি উপসর্গ দেখা দিতে পারে। অনেক সময় লিভার আক্রান্ত হয়ে রোগীর জন্ডিস, কিডনিতে আক্রান্ত হয়ে রেনাল ফেইলিউর ইত্যাদি জটিলতা দেখা দিতে পারে।' +
            '</p>' + '<p>' + 'ডেঙ্গু জ্বরের ভয়াভহ রূপ হলো ডেঙ্গু শক সিনড্রোম। ডেঙ্গু হেমোরেজিক ফিভারের সঙ্গে সার্কুলেটরি ফেইলিউর হয়ে ডেঙ্গু শক সিনড্রোম হয়। এর লক্ষণ হলো :' +
            '<br /> <br />' + ' <ul>' + '<li> রক্তচাপ হঠাৎ কমে যাওয়া। </li>' + '<li>' + 'নাড়ির স্পন্দন অত্যন্ত ক্ষীণ ও দ্রুত হওয়া।' + '</li>' + '<li>' + 'শরীরের হাত-পা ও অন্যান্য অংশ ঠান্ডা হয়ে যায়।' +
            '</li>' + '  <li>' + '   প্রস্রাব কমে যায়।' + '</li>' + '<li>' + 'হঠাৎ করে রোগী জ্ঞান হারিয়ে ফেলতে পারে।' + '</li>' +
            '<li>' + 'এমনকি মৃত্যু পর্যন্ত হতে পারে।' + '</li>' + '</ul>' + '' + '<br />' + '' + ' ডেঙ্গু জ্বরে আক্রান্ত বেশির ভাগ রোগী সাধারণত পাঁচ থেকে ১০ দিনের মধ্যে নিজে নিজেই ভালো হয়ে যায়, তাই উপসর্গ অনুযায়ী সাধারণ চিকিৎসা যথেষ্ট।  তবে ডেঙ্গুজনিত কোনো মারাত্মক জটিলতা যাতে  না হয় তাই রোগীকে অবশ্যই চিকিৎসকের পরামর্শ নিয়েই চলতে হবে। তবে কিছু কিছু ক্ষেত্রে চিকিৎসকের পরামর্শ নেওয়াই ভালো। যেমন :' +
            '' + '<br /> <br />' + '' + '<ul>' + '<li>' + '<li>' + 'শরীরের যেকোনো অংশে রক্তপাত হলে' + '</li>' + '<li>' + 'প্লাটিলেটের মাত্রা কমে গেলে' + '</li>' + '<li>' + 'শ্বাস কষ্ট হলে বা পেট ফুলে পানি আসলে' + '</li>' + '<li>' + 'প্রস্রাবের পরিমাণ কমে গেলে' + '</li>' + '<li>' + 'জন্ডিস দেখা দিলে' + '</li>' + '<li>' + 'অতিরিক্ত ক্লান্তি বা দুর্বলতা দেখা দিলে' + '</li>' + ' <li>  প্রচণ্ড পেটে ব্যথা বা বমি হলে।</li>' + ' </ul>' + '' + '<br />' + '<b>প্রতিকার:</b>' + '' + 'সম্পূর্ণ ভালো না হওয়া পর্যন্ত বিশ্রামে থাকতে হবে।' + 'যথেষ্ট পরিমাণে পানি, শরবত, ডাবের পানি ও অন্যান্য তরল জাতীয় খাবার গ্রহণ করতে হবে।' + 'খেতে না পারলে দরকার হলে ডাক্তারের পরামর্শে শিরাপথে স্যালাইন দেওয়া যেতে পারে।' + 'জ্বর কমানোর জন্য শুধুমাত্র প্যারাসিটামল-জাতীয় ব্যথার ওষুধই যথেষ্ট। এসপিরিন বা ডাইক্লোফেনাক-জাতীয় ব্যথার ওষুধ কোনোক্রমেই খাওয়া যাবে না। এতে রক্তক্ষরণের ঝুঁকি বাড়বে।' +
            ' জ্বর কমানোর জন্য ভেজা কাপড় দিয়ে গা মোছাতে হবে।' + '' + '<br /> <br />' + '' + '<b>' + ' প্রতিরোধ:' + '</b>' + 'ডেঙ্গু জ্বর প্রতিরোধের মূল মন্ত্রই হলো এডিস মশার বিস্তার রোধ এবং এই মশা যেন কামড়াতে না পারে তার ব্যবস্থা করা। এরা স্বচ্ছ পরিষ্কার পানিতে ডিম পাড়ে।তাই ডেঙ্গু প্রতিরোধে এডিস মশার ডিম পাড়ার উপযোগী স্থানগুলোকে পরিষ্কার রাখতে হবে এবং একই সঙ্গে মশা নিধনের জন্য প্রয়োজনীয় ব্যবস্থা নিতে হবে।' +
            '' + 'বাড়ির আশপাশের ঝোঁপঝাড়, জঙ্গল, জলাশয় ইত্যাদি পরিষ্কার-পরিচ্ছন্ন রাখতে হবে।' + ' যেহেতু এডিস মশা মূলত এমন বস্তুর মধ্যে ডিম পাড়ে, যেখানে স্বচ্ছ পানি জমে থাকে। তাই ফুলদানি, অব্যবহৃত কৌটা, ডাবের খোলা, পরিত্যক্ত টায়ার ইত্যাদি সরিয়ে ফেলতে হবে।' +
            'ঘরের বাথরুমে বা কোথাও জমানো পানি পাঁচদিনের বেশি যেন না থাকে। অ্যাকুয়ারিয়াম, ফ্রিজ বা এয়ারকন্ডিশনারের নিচেও যেন পানি জমে না থাকে।' +
            'এডিস মশা সাধারণত সকালে ও সন্ধ্যায় কামড়ায়। তবে অন্য কোনো সময়ও কামড়াতে পারে। তাই দিনের বেলা শরীরে ভালোভাবে কাপড় ঢেকে বের হতে হবে।' +
            'মশা নিধনের স্প্রে, কয়েল, ম্যাট ব্যবহারের সঙ্গে সঙ্গে মশার কামড় থেকে বাঁচার জন্য দিনে ও রাতে মশারি ব্যবহার করতে হবে।' +
            ' ডেঙ্গু আক্রান্ত রোগীকে অবশ্যই সব সময় মশারির মধ্যে রাখতে হবে, যাতে করে কোনো মশা কামড়াতে না পারে।' +
            '' + '<br /> <br />' + '' + ' জ্বর প্রথম দিন থেকেই জটিল আকার মনে হলে চিকিৎসকের পরামর্শ নিন। নয়তো বাড়িতে তিন দিন পর্যন্ত অপেক্ষা করতে পারেন। তিন দিনে জ্বর না কমলে চিকিৎসকের শরণাপন্ন হতে হবে। নিজে দোকান থেকে কিনে কোনো অ্যান্টিবায়োটিক ওষুধ খাওয়া যাবে না, হিতে বিপরীত হতে পারে। রোগীর অবস্থা অনুযায়ী চিকিৎসক সিদ্ধান্ত নেবেন। একেকজনের জন্য চিকিৎসা পদ্ধতি ভিন্ন হতে পারে।' +
            '</p>' +
            '</div>'));
        return view.Container
    };
}).call(AppBlog, AppBase);